САС_Центр/src/InformationRegisters/Инциденты/Инциденты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Инциденты</name>
  <resources>
    <name>Хэш</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Инцидент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

САС_Центр/src/InformationRegisters/ИнцидентыКОбработке/ИнцидентыКОбработке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИнцидентыКОбработке</name>
  <resources>
    <name>ТекстОтчетаJSON</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОтвета</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>ОтветПолучен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Инцидент</name>
    <type>
      <types>DocumentRef.Инцидент</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

САС_Центр/src/Documents/Инцидент/Инцидент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Инцидент</name>
  <attributes>
    <name>ТекстОтчетаJSON</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветYandexGPT</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветПолучен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПрисоединенныеФайлы</name>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.ПрисоединённыеФайлыИнциденты</types>
      </type>
    </attributes>
    <attributes>
      <name>РасширениеФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

САС_Центр/src/Catalogs/ПрисоединённыеФайлыИнциденты/ПрисоединённыеФайлыИнциденты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрисоединённыеФайлыИнциденты</name>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Инцидент</name>
    <type>
      <types>DocumentRef.Инцидент</types>
    </type>
  </attributes>
</mdclass:Catalog>

САС_Центр/src/CommonModules/САС_ОбщегоНазначенияСервер/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Процедура ОбработатьДамп
//
// Описание: Вызывается из http-сервиса PushReport. 
//           Вытаскивает информацию из zip-файла полученного по PushReport.
//           Создает задачу, прицепляет к задаче файлы.
//
// Параметры:
//  ДанныеОтчета - ДвоичныеДанные - данные отчета в формате ZIP
//
Процедура ОбработатьДамп(Знач ДанныеОтчета) Экспорт 
	
	ИнформацияОтчета 		  = ПолучитьИнформациюИзОтчета(ДанныеОтчета);
	ИнформацияОтчетаСтруктура = ИнформацияОтчета.ReportStructure;
	
	АппСтэк = ЗначениеСвойстваJSON(ИнформацияОтчетаСтруктура, "errorInfo.applicationErrorInfo.stackHash");
	Если АппСтэк <> Неопределено Тогда
		ТекстОшибки = ЗначениеСвойстваJSON(ИнформацияОтчетаСтруктура, "errorInfo.applicationErrorInfo");
		//ИдКлиента = ИнформацияОтчета.additionalData[1].ИдКлиента;
		ИдКлиента = ИнформацияОтчета.clientId;
		ЗаписьJSON = Новый ЗаписьJSON();
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, ТекстОшибки);
		СтрокаОшибки = ЗаписьJSON.Закрыть();
		
		ТекЗадача = СоздатьЗадачу(ИнформацияОтчетаСтруктура, СтрокаОшибки);
		
		ДДОтчет = ПолучитьДвоичныеДанныеИзСтроки(ИнформацияОтчета.Report, "UTF-8");
		ДДСкрин = ИнформацияОтчета.Screenshot.Получить();
		ПрицепитьФайлы(ТекЗадача, ДДОтчет, ДДСкрин);
		
		ХэшОшибки = "" + ИнформацияОтчетаСтруктура.configInfo.hash + "-" 
			+ ИнформацияОтчетаСтруктура.errorInfo.systemErrorInfo.clientStackHash + "-" 
				+ АппСтэк;
		
		ЗаписатьОшибкуВРегистр(ТекЗадача, ХэшОшибки);
		
	Иначе
		СтрокаОшибки = ИнформацияОтчетаСтруктура.errorInfo.applicationErrorInfo.errors[0][0] 
			+ Символы.ПС  
				+ ИнформацияОтчетаСтруктура.errorInfo.applicationErrorInfo.errors[1][0];
		АппСтэк  = Новый ХешированиеДанных(ХешФункция.SHA1) ;
		АппСтэк.Добавить(СтрокаОшибки);
		ХэшАппСтэк = СтрЗаменить(АппСтэк.ХешСумма, " ", "");
		
		ХэшОшибки = "" + ИнформацияОтчетаСтруктура.configInfo.hash + "-" 
			+ ИнформацияОтчетаСтруктура.errorInfo.systemErrorInfo.clientStackHash + "-" 
				+ ХэшАппСтэк;
		
		НайденныйХэш = НайтиЗадачу(ХэшОшибки, ИдКлиента);
		
		Если НайденныйХэш <> Неопределено Тогда
			Возврат;
		Иначе 
			Инцидент = СоздатьЗадачу(ИнформацияОтчетаСтруктура, СтрокаОшибки);
			
			ДДОтчет = ПолучитьДвоичныеДанныеИзСтроки(ИнформацияОтчета.Report, "UTF-8");
			ДДСкрин = ИнформацияОтчета.Screenshot.Получить();
			ПрицепитьФайлы(Инцидент, ДДОтчет, ДДСкрин);
			
			ХэшОшибки = "" + ИнформацияОтчетаСтруктура.configInfo.hash + "-" 
				+ ИнформацияОтчетаСтруктура.errorInfo.systemErrorInfo.clientStackHash + "-" 
					+ ХэшАппСтэк;
			
			ЗаписатьОшибкуВРегистр(Инцидент, ХэшОшибки);
			
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры // ОбработатьДамп

Функция ЗначениеСвойстваJSON(Структура, ПутьКСвойству) Экспорт 
	
	Путь = СтрРазделить(ПутьКСвойству, ".", Ложь);
	
	ТекущийОбъект = Структура;
	
	Для Каждого ЧастьПути Из Путь Цикл 
		Если Не ТекущийОбъект.Свойство(ЧастьПути) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ТекущийОбъект = ТекущийОбъект[ЧастьПути];
		
	КонецЦикла;
	
	Возврат ТекущийОбъект;
	
КонецФункции

// Процедура ЗаписатьОшибкуВРегистр
//
// Описание: Записывает в регистр сведений текущую ошибку
//
// Параметры:
//  Инцидент - ДокументСсылка.Инцидент - ссылка на задачу по ошибке
//  ХэшОшибки - Строка - уникальный хэш ошибки
//
Процедура ЗаписатьОшибкуВРегистр(Инцидент, ХэшОшибки)
	
	ТекЗапись = РегистрыСведений.Инциденты.СоздатьМенеджерЗаписи();
	ТекЗапись.Хэш = ХэшОшибки;
	ТекЗапись.Прочитать();
	ТекЗапись.Инцидент = Инцидент;
	ТекЗапись.Записать();
	
КонецПроцедуры // ЗаписатьОшибкуВРегистр

// Процедура ПрицепитьФайлы
//
// Описание: Прицепляет к задаче файл отчета и скриншот
//
// Параметры:
//  Инцидент - ДокументСсылка.Инцидент - владелец файлов
//  Отчет - ДвоичныеДанные - XML отчета в виде двоичных данных
//  Скриншот - ДвоичныеДанные - скриншот в виде двоичных данных
//
Процедура ПрицепитьФайлы(Инцидент, Отчет, Скриншот)
	
	ИнцидентОбъект = Инцидент.ПолучитьОбъект();
	НомерИнцидента = ИнцидентОбъект.Номер;
	
	НовыйФайл = Справочники.ПрисоединённыеФайлыИнциденты.СоздатьЭлемент();
	НовыйФайл.Наименование = "Скриншот_" + НомерИнцидента;
	НовыйФайл.Расширение = ".png";
	НовыйФайл.ДанныеФайла = Новый ХранилищеЗначения(Скриншот);
	НовыйФайл.Инцидент = Инцидент;
	НовыйФайл.Записать();
	
	НоваяСтрока = ИнцидентОбъект.ПрисоединенныеФайлы.Добавить();
	НоваяСтрока.Файл = НовыйФайл.Ссылка;
	НоваяСтрока.РасширениеФайла = НовыйФайл.Расширение;
	
	НовыйФайл = Справочники.ПрисоединённыеФайлыИнциденты.СоздатьЭлемент();
	НовыйФайл.Наименование = "Отчет_" + НомерИнцидента;
	НовыйФайл.Расширение = ".json";
	НовыйФайл.ДанныеФайла = Новый ХранилищеЗначения(Отчет);
	НовыйФайл.Инцидент = Инцидент;
	НовыйФайл.Записать();
	
	НоваяСтрока = ИнцидентОбъект.ПрисоединенныеФайлы.Добавить();
	НоваяСтрока.Файл = НовыйФайл.Ссылка;
	НоваяСтрока.РасширениеФайла = НовыйФайл.Расширение;
	
	ИнцидентОбъект.Записать();
	
КонецПроцедуры // ПрицепитьФайлы

// Описание: Создает задачу из структуры отчета об ошибке
//
// Параметры:
//  ИнформацияОтчетаСтруктура - Структура - из XML файла report.json
//  СтрокаОшибки - Строка - строка для описания ошибки в задаче
//
// Возвращаемое значение:
//   ДокументСсылка.Инцидент - ссылка на созданный документ
//
Функция СоздатьЗадачу(ИнформацияОтчетаСтруктура, СтрокаОшибки)

	ДокументИнцидент = Документы.Инцидент.СоздатьДокумент();
	ДокументИнцидент.Дата = ТекущаяДатаСеанса();
	ДокументИнцидент.ТекстОтчетаJSON = СтрокаОшибки;
	ДокументИнцидент.ИдКлиента = ИнформацияОтчетаСтруктура.additionalData.ИдКлиента;

	Попытка
		ДокументИнцидент.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("Ошибка создания документа Инцидент");
	КонецПопытки;
	
	Возврат ДокументИнцидент.Ссылка;    
КонецФункции // СоздатьЗадачу

Функция ПолучитьИнформациюИзОтчета(ДанныеОтчета) 
	
	Отчет = Неопределено;
	ОтчетСтруктура = Неопределено;
	Скриншот = Неопределено;
	
	ЧтениеАрхива = Новый ЧтениеФайлаАрхива(ДанныеОтчета.ОткрытьПотокДляЧтения());
	
	Для Каждого Элемент Из ЧтениеАрхива.Элементы Цикл 
		Если Элемент.Имя = "report.json" Тогда
			
			ПутьКПапкеReportJson = ПолучитьИмяВременногоФайла();
			ЧтениеАрхива.Извлечь(Элемент, ПутьКПапкеReportJson);
			
			ЧтениеТекста = Новый ЧтениеТекста(ПутьКПапкеReportJson + ПолучитьРазделительПути() + "report.json", 
												КодировкаТекста.UTF8);
			Отчет = ЧтениеТекста.Прочитать();
			ЧтениеТекста.Закрыть();
			
			ЧтениеJson = Новый ЧтениеJSON();
			ЧтениеJson.ОткрытьФайл(ПутьКПапкеReportJson + ПолучитьРазделительПути() + "report.json");
			ОтчетСтруктура = ПрочитатьJSON(ЧтениеJson);			
			ЧтениеJson.Закрыть();
			
			УдалитьФайлы(ПутьКПапкеReportJson);
			
		ИначеЕсли Элемент.Имя = "screenshot.png" Тогда
			
			ПутьКПапкеScreenshot = ПолучитьИмяВременногоФайла();
			ЧтениеАрхива.Извлечь(Элемент, ПутьКПапкеScreenshot);
			Картинка = Новый ДвоичныеДанные(ПутьКПапкеScreenshot + ПолучитьРазделительПути() + "screenshot.png");
			Скриншот = Новый ХранилищеЗначения(Картинка);
			УдалитьФайлы(ПутьКПапкеScreenshot);
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("Report, ReportStructure, Screenshot", Отчет, ОтчетСтруктура, Скриншот); 
	
КонецФункции

Функция НайтиЗадачу(ХэшОшибки, ИдКлиента) Экспорт 
	
	Инцидент = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Инциденты.Хэш КАК Хэш,
	|	Инциденты.ИдКлиента КАК ИдКлиента,
	|	Инциденты.Инцидент КАК Инцидент
	|ИЗ
	|	РегистрСведений.Инциденты КАК Инциденты
	|ГДЕ
	|	Инциденты.Хэш = &Хэш
	|	И Инциденты.ИдКлиента = &ИдКлиента";
	
	Запрос.УстановитьПараметр("Хэш", ХэшОшибки);
	Запрос.УстановитьПараметр("ИдКлиента", ИдКлиента);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		РезультатЗапроса.Следующий();
		Инцидент = РезультатЗапроса.Инцидент;	
	КонецЕсли;
	
	Возврат Инцидент;
	
КонецФункции  

Процедура ОтправкаЗапросовYandexGPT() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИнцидентыКОбработкеllm.Инцидент КАК Инцидент,
	|	ИнцидентыКОбработкеllm.ОтветПолучен КАК ОтветПолучен,
	|	ИнцидентыКОбработкеllm.ТекстОтчетаJSON КАК ТекстОтчетаJSON
	|ИЗ
	|	РегистрСведений.ИнцидентыКОбработкеllm КАК ИнцидентыКОбработкеllm
	|ГДЕ
	|	НЕ ИнцидентыКОбработкеllm.ОтветПолучен";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ОтветYandexGPT = ЯндексGPT.ОтправитьЗапросКYandexGPT(
		"Разбери ошибку из текста JSON для 1С. Дай полный анализ, напиши рекомендации по исправлению. Классифицируй ошибки по видам (Программная или аналитическая). Дай развернутый ответ. Текст:" 
		+ Символы.ПС + ВыборкаДетальныеЗаписи.ТекстОтчетаJSON);
		
		МенеджерЗаписи = РегистрыСведений.ИнцидентыКОбработке.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаДетальныеЗаписи); 
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.ОтветПолучен = Истина;
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;
		
		ИнцидентОбъект = ВыборкаДетальныеЗаписи.Инцидент.ПолучитьОбъект();
		ИнцидентОбъект.ОтветYandexGPT = ОтветYandexGPT;
		ИнцидентОбъект.ОтветПолучен = Истина; 
		
		Попытка
			ИнцидентОбъект.Записать();
		Исключение 
			ЗаписьЖурналаРегистрации("Ошибка записи инцидента", УровеньЖурналаРегистрации.Ошибка, , ,ИнформацияОбОшибке());
		КонецПопытки;
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти
